{"class_name": "Tokenizer", "config": {"num_words": 10000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 5000, "word_counts": "{\"mediawiki\": 21, \"before\": 1040, \"1\": 1059, \"19\": 145, \"4\": 970, \"and\": 2913, \"20\": 346, \"x\": 301, \"3\": 434, \"contains\": 117, \"an\": 2581, \"error\": 126, \"in\": 5806, \"the\": 3796, \"api\": 21, \"php\": 26, \"script\": 42, \"which\": 411, \"allows\": 429, \"remote\": 925, \"attackers\": 234, \"to\": 4355, \"obtain\": 79, \"sensitive\": 53, \"information\": 1459, \"debian\": 502, \"linux\": 850, \"cause\": 329, \"a\": 4851, \"denial\": 1048, \"of\": 4872, \"service\": 1393, \"application\": 81, \"crash\": 186, \"by\": 730, \"sending\": 73, \"specially\": 264, \"crafted\": 454, \"request\": 113, \"fedora\": 124, \"redhat\": 346, \"fedoraproject\": 32, \"enterprise\": 167, \"tuned\": 29, \"2\": 467, \"10\": 390, \"0\": 741, \"creates\": 14, \"its\": 168, \"pid\": 15, \"file\": 511, \"with\": 584, \"insecure\": 64, \"permissions\": 60, \"local\": 1382, \"users\": 150, \"kill\": 20, \"arbitrary\": 491, \"processes\": 25, \"server\": 1252, \"desktop\": 21, \"node\": 4, \"cookie\": 18, \"signature\": 12, \"6\": 171, \"is\": 1776, \"affected\": 162, \"timing\": 4, \"attack\": 118, \"due\": 292, \"type\": 134, \"comparison\": 4, \"used\": 83, \"rubygems\": 3, \"passenger\": 3, \"betas\": 3, \"delete\": 4, \"files\": 193, \"during\": 150, \"startup\": 3, \"process\": 63, \"openshift\": 12, \"surf\": 4, \"jar\": 4, \"has\": 225, \"read\": 222, \"access\": 1892, \"from\": 1383, \"other\": 45, \"user\": 1790, \"apache\": 28, \"shiro\": 6, \"when\": 1701, \"using\": 75, \"default\": 32, \"remember\": 3, \"me\": 3, \"configuration\": 39, \"security\": 365, \"bypass\": 345, \"vulnerability\": 2506, \"exists\": 1781, \"tboot\": 8, \"8\": 544, \"boot\": 170, \"loader\": 13, \"module\": 34, \"measuring\": 8, \"commandline\": 8, \"parameters\": 28, \"cross\": 59, \"site\": 44, \"scripting\": 77, \"xss\": 79, \"jenkins\": 21, \"main\": 15, \"482\": 6, \"lts\": 6, \"466\": 6, \"inject\": 15, \"web\": 55, \"or\": 562, \"html\": 45, \"ci\": 2, \"game\": 2, \"plugin\": 28, \"violations\": 1, \"xxe\": 7, \"on\": 773, \"micro\": 1, \"focus\": 1, \"operations\": 109, \"agent\": 8, \"version\": 148, \"12\": 68, \"01\": 12, \"02\": 5, \"03\": 14, \"04\": 8, \"05\": 11, \"06\": 3, \"11\": 261, \"could\": 565, \"be\": 368, \"exploited\": 39, \"do\": 23, \"hp\": 410, \"atlas\": 2, \"versions\": 544, \"were\": 29, \"found\": 78, \"vulnerable\": 59, \"stored\": 11, \"search\": 12, \"functionality\": 45, \"via\": 1361, \"url\": 8, \"that\": 480, \"points\": 1, \"http\": 67, \"master\": 10, \"insert\": 4, \"data\": 231, \"execute\": 263, \"code\": 1108, \"nvidia\": 7, \"nvflash\": 2, \"nvuflash\": 2, \"tool\": 4, \"prior\": 37, \"v5\": 309, \"588\": 1, \"gpumodeswitch\": 1, \"2019\": 3078, \"kernel\": 375, \"mode\": 153, \"driver\": 345, \"sys\": 19, \"nvflsh32\": 1, \"nvflsh64\": 1, \"authenticated\": 639, \"administrative\": 5, \"privileges\": 200, \"can\": 538, \"gain\": 33, \"device\": 137, \"memory\": 1711, \"registers\": 2, \"devices\": 11, \"not\": 389, \"managed\": 3, \"may\": 1420, \"lead\": 231, \"escalation\": 691, \"disclosure\": 1175, \"persistent\": 4, \"octopus\": 4, \"through\": 129, \"5\": 486, \"microsoft\": 2022, \"vmware\": 7, \"leaks\": 22, \"clock\": 16, \"source\": 21, \"create\": 35, \"functions\": 6, \"under\": 168, \"drivers\": 101, \"gpu\": 28, \"drm\": 28, \"amd\": 24, \"display\": 31, \"dc\": 30, \"allow\": 1484, \"consumption\": 104, \"this\": 1498, \"affects\": 12, \"dce112\": 9, \"function\": 249, \"resource\": 95, \"c\": 383, \"dce100\": 9, \"dcn10\": 9, \"dcn20\": 6, \"dce120\": 9, \"dce110\": 9, \"dce80\": 6, \"aka\": 1803, \"cid\": 89, \"055e547478a1\": 2, \"pool\": 6, \"104c307147ad\": 1, \"leak\": 162, \"nfp\": 18, \"flower\": 16, \"spawn\": 8, \"vnic\": 5, \"reprs\": 8, \"net\": 55, \"ethernet\": 51, \"netronome\": 9, \"8ce39eb5a67a\": 5, \"four\": 5, \"phy\": 3, \"8572cea1461a\": 3, \"qrtr\": 4, \"tun\": 4, \"write\": 136, \"iter\": 4, \"a21b7f0cff19\": 2, \"bnxt\": 2, \"re\": 2, \"srq\": 1, \"infiniband\": 2, \"hw\": 7, \"ib\": 1, \"verbs\": 1, \"triggering\": 57, \"copy\": 16, \"udata\": 1, \"failures\": 57, \"4a9d46a9fe14\": 1, \"abm\": 2, \"u32\": 1, \"knode\": 1, \"replace\": 4, \"cls\": 1, \"78beef629fd9\": 1, \"ath9k\": 3, \"wmi\": 2, \"cmd\": 5, \"wireless\": 25, \"ath\": 2, \"728c1e2a05e4\": 1, \"htc\": 4, \"hst\": 1, \"wait\": 1, \"for\": 2104, \"completion\": 1, \"timeout\": 2, \"config\": 15, \"pipe\": 1, \"credits\": 1, \"setup\": 2, \"complete\": 1, \"connect\": 13, \"853acf7caf10\": 1, \"rsi\": 12, \"send\": 81, \"beacon\": 6, \"91x\": 3, \"mgmt\": 3, \"prepare\": 5, \"d563131ef23c\": 3, \"disputed\": 21, \"spi\": 7, \"gpio\": 2, \"probe\": 8, \"devm\": 1, \"add\": 13, \"action\": 3, \"reset\": 1, \"d3b0ffa1d75d\": 1, \"note\": 19, \"third\": 14, \"parties\": 12, \"dispute\": 9, \"relevance\": 9, \"because\": 89, \"system\": 1175, \"must\": 35, \"have\": 121, \"already\": 7, \"been\": 129, \"out\": 256, \"began\": 1, \"fastrpc\": 8, \"dma\": 13, \"buf\": 11, \"attach\": 6, \"misc\": 4, \"9\": 371, \"get\": 73, \"sgtable\": 6, \"fc739a058d99\": 4, \"acp\": 4, \"init\": 14, \"amdgpu\": 4, \"mfd\": 2, \"hotplug\": 2, \"pm\": 5, \"genpd\": 2, \"57be09c6e874\": 2, \"attacker\": 598, \"loading\": 7, \"bfad\": 2, \"im\": 1, \"stats\": 4, \"scsi\": 1, \"bfa\": 2, \"attr\": 1, \"port\": 45, \"0e62395da2bd\": 1, \"sdma\": 2, \"hfi1\": 1, \"rhashtable\": 1, \"34b3be18a04e\": 1, \"fsl\": 2, \"lpspi\": 2, \"runtime\": 37, \"sync\": 1, \"057b8945f78f\": 1, \"cannot\": 3, \"realistically\": 2, \"control\": 360, \"these\": 12, \"at\": 8, \"time\": 15, \"two\": 30, \"rtl\": 1, \"usb\": 21, \"realtek\": 1, \"rtlwifi\": 1, \"3f9361695113\": 1, \"crypto\": 68, \"report\": 7, \"base\": 3, \"alg\": 6, \"ffdde5932042\": 1, \"adis\": 6, \"update\": 40, \"scan\": 19, \"burst\": 3, \"iio\": 3, \"imu\": 3, \"buffer\": 225, \"9c0530e898f3\": 3, \"multiple\": 374, \"iwl\": 9, \"pcie\": 19, \"ctxt\": 6, \"info\": 19, \"gen3\": 6, \"intel\": 4336, \"iwlwifi\": 5, \"fw\": 5, \"sec\": 19, \"alloc\": 15, \"coherent\": 3, \"0f4f199443fa\": 3, \"dbg\": 11, \"page\": 288, \"b4b814fec1a5\": 2, \"mwifiex\": 15, \"cmdrsp\": 5, \"marvell\": 5, \"map\": 5, \"pci\": 20, \"db8fd2cde932\": 5, \"nl80211\": 4, \"ftm\": 2, \"responder\": 2, \"nl80211hdr\": 2, \"put\": 2, \"1399c59fa929\": 2, \"it\": 203, \"occurs\": 19, \"path\": 16, \"where\": 84, \"successful\": 65, \"allocation\": 7, \"occurred\": 2, \"cx23888\": 2, \"ir\": 2, \"media\": 75, \"cx23885\": 1, \"kfifo\": 1, \"a7b2df76b42b\": 1, \"rpmsg\": 3, \"eptdev\": 1, \"char\": 2, \"full\": 6, \"bbe692e349e2\": 1, \"gs\": 8, \"open\": 49, \"submit\": 4, \"urb\": 4, \"fb5be6a7b486\": 4, \"i2400m\": 6, \"op\": 6, \"rfkill\": 6, \"sw\": 3, \"toggle\": 3, \"wimax\": 3, \"6f3ef5c25cc7\": 3, \"reportstat\": 14, \"stat\": 5, \"c03b04dcdba1\": 5, \"unittest\": 6, \"fdt\": 2, \"unflatten\": 2, \"tree\": 2, \"e13de8fe0d6a\": 2, \"only\": 24, \"reached\": 2, \"virt\": 4, \"vboxguest\": 8, \"utils\": 4, \"form\": 17, \"e0b0cb938864\": 4, \"ipmi\": 3, \"bmc\": 1, \"register\": 1, \"msghandler\": 1, \"ida\": 1, \"simple\": 3, \"failure\": 6, \"4aa7afb0ee20\": 1, \"mlx5\": 6, \"fpga\": 4, \"conn\": 4, \"cq\": 2, \"mellanox\": 2, \"core\": 865, \"vector2eqn\": 2, \"c8c2a057fdc7\": 2, \"eval\": 4, \"injection\": 37, \"math\": 4, \"limnoria\": 4, \"09\": 11, \"supybot\": 4, \"2018\": 75, \"unprivileged\": 82, \"disclose\": 4, \"possibly\": 29, \"unspecified\": 15, \"impact\": 13, \"calc\": 6, \"icalc\": 4, \"irc\": 27, \"commands\": 30, \"big\": 54, \"ip\": 97, \"15\": 40, \"14\": 169, \"certain\": 428, \"conditions\": 24, \"network\": 152, \"protections\": 47, \"management\": 238, \"follow\": 5, \"current\": 14, \"best\": 5, \"practices\": 5, \"policy\": 22, \"enforcement\": 1, \"manager\": 134, \"f5\": 21, \"link\": 9, \"controller\": 61, \"global\": 2, \"traffic\": 50, \"fraud\": 4, \"protection\": 334, \"13\": 45, \"iq\": 13, \"7\": 318, \"iworkflow\": 3, \"utility\": 7, \"anti\": 3, \"dns\": 25, \"pinning\": 3, \"rebinding\": 3, \"oracle\": 7, \"edge\": 55, \"gateway\": 9, \"domain\": 13, \"name\": 34, \"logged\": 25, \"into\": 71, \"log\": 58, \"logging\": 7, \"targets\": 3, \"restjavad\": 3, \"invalid\": 49, \"would\": 126, \"able\": 101, \"view\": 20, \"apm\": 1, \"requests\": 80, \"apd\": 1, \"apmd\": 1, \"daemon\": 28, \"consume\": 6, \"excessive\": 6, \"resources\": 15, \"undisclosed\": 10, \"amounts\": 5, \"systems\": 61, \"analytics\": 29, \"advanced\": 9, \"firewall\": 1, \"virtual\": 258, \"servers\": 1, \"tlsv1\": 1, \"enabled\": 15, \"experience\": 1, \"incoming\": 1, \"messages\": 113, \"symantec\": 13, \"endpoint\": 28, \"ru2\": 9, \"susceptible\": 9, \"privilege\": 2285, \"issue\": 156, \"whereby\": 5, \"attempt\": 5, \"compromise\": 5, \"software\": 233, \"elevated\": 5, \"are\": 181, \"normally\": 5, \"protected\": 213, \"unsigned\": 4, \"execution\": 1024, \"individual\": 4, \"without\": 106, \"resident\": 4, \"proper\": 48, \"digital\": 7, \"jetty\": 15, \"22\": 15, \"suffers\": 5, \"escape\": 10, \"sequence\": 33, \"vector\": 10, \"means\": 5, \"dump\": 62, \"servlet\": 12, \"content\": 52, \"length\": 61, \"header\": 73, \"post\": 6, \"test\": 5, \"age\": 5, \"parameter\": 36, \"set\": 92, \"string\": 30, \"throws\": 5, \"java\": 37, \"lang\": 5, \"numberformatexception\": 5, \"reflects\": 5, \"binary\": 6, \"characters\": 24, \"including\": 38, \"esc\": 5, \"dumps\": 5, \"terminal\": 5, \"requesting\": 5, \"consonant\": 5, \"letters\": 5, \"install\": 2, \"temporary\": 23, \"creation\": 150, \"result\": 228, \"clamav\": 20, \"97\": 20, \"printhex\": 9, \"possible\": 306, \"overflow\": 265, \"libclamav\": 11, \"component\": 666, \"wwpack\": 5, \"corrupt\": 43, \"heap\": 36, \"createprojectionmapforquery\": 2, \"tvprovider\": 2, \"there\": 131, \"sql\": 12, \"no\": 88, \"additional\": 78, \"needed\": 194, \"interaction\": 97, \"exploitation\": 126, \"product\": 101, \"androidversions\": 97, \"android\": 373, \"10android\": 74, \"id\": 1133, \"135269669\": 2, \"google\": 211, \"poisson\": 1, \"distribution\": 1, \"random\": 1, \"bounds\": 104, \"139690488\": 1, \"binder\": 14, \"free\": 128, \"transaction\": 7, \"use\": 175, \"after\": 109, \"race\": 40, \"condition\": 139, \"kernelandroid\": 14, \"133758011references\": 3, \"upstream\": 7, \"was\": 177, \"discovered\": 24, \"zyxel\": 4, \"gs1900\": 4, \"firmware\": 2353, \"50\": 5, \"aahh\": 2, \"c0\": 2, \"undocumented\": 2, \"keypresses\": 1, \"triggered\": 63, \"diagnostics\": 4, \"shell\": 1, \"ctrl\": 5, \"alt\": 1, \"t\": 18, \"prompts\": 1, \"password\": 68, \"returned\": 48, \"fds\": 4, \"passdebugpasswd\": 2, \"ret\": 4, \"checks\": 30, \"determine\": 1, \"if\": 69, \"allowed\": 1, \"performs\": 14, \"check\": 154, \"remotedebugenable\": 1, \"libfds\": 2, \"so\": 26, \"always\": 1, \"return\": 6, \"true\": 4, \"actual\": 1, \"performed\": 1, \"menu\": 2, \"reading\": 10, \"writing\": 1, \"various\": 5, \"believed\": 1, \"related\": 17, \"interface\": 23, \"chips\": 1, \"10hp\": 1, \"image\": 26, \"encrypted\": 1, \"passwords\": 28, \"authenticate\": 1, \"wishing\": 1, \"recovery\": 1, \"hardcoded\": 4, \"cryptographic\": 2, \"key\": 127, \"elsewhere\": 1, \"decrypted\": 1, \"passrecoverypasswd\": 1, \"24e\": 1, \"missing\": 38, \"136210786references\": 4, \"insufficient\": 779, \"subsystem\": 283, \"r\": 4991, \"txt\": 332, \"6th\": 360, \"7th\": 249, \"8th\": 249, \"9th\": 249, \"generation\": 448, \"tm\": 249, \"processor\": 1503, \"families\": 647, \"xeon\": 1951, \"e3\": 357, \"1500\": 249, \"v6\": 283, \"e\": 607, \"2100\": 249, \"2200\": 249, \"graphics\": 812, \"privileged\": 775, \"potentially\": 1159, \"enable\": 1105, \"i7\": 157, \"8665u\": 3, \"6822eq\": 3, \"6700te\": 4, \"m7\": 2, \"6y75\": 2, \"1565l\": 6, \"1558l\": 4, \"1535m\": 6, \"1280\": 5, \"1235l\": 2, \"1225\": 10, \"1220\": 7, \"i5\": 78, \"6600t\": 1, \"6500\": 2, \"6820hq\": 4, \"1505m\": 3, \"1505l\": 6, \"1501l\": 3, \"7y75\": 4, \"7360u\": 2, \"7660u\": 3, \"7442eq\": 1, \"7440eq\": 2, \"8706g\": 3, \"8510y\": 1, \"9600k\": 5, \"9600t\": 3, \"2126g\": 5, \"2144g\": 5, \"2276g\": 6, \"2274g\": 3, \"2226g\": 3, \"2224g\": 3, \"8700t\": 4, \"smm\": 224, \"processors\": 1415, \"w\": 15, \"2155\": 1, \"3175x\": 1, \"d\": 254, \"2142it\": 2, \"2161i\": 5, \"silver\": 115, \"4210\": 1, \"4209t\": 3, \"gold\": 190, \"6126f\": 2, \"6132\": 3, \"6140m\": 1, \"6140\": 2, \"5115\": 2, \"6126\": 1, \"5122\": 3, \"6262v\": 1, \"5218t\": 2, \"6246\": 3, \"6240l\": 3, \"6254\": 2, \"6238m\": 2, \"5222\": 2, \"6230\": 2, \"5218\": 2, \"platinum\": 37, \"8180\": 2, \"8160\": 1, \"8176\": 4, \"8270\": 1, \"8268\": 3, \"8260y\": 2, \"8280\": 2, \"8260\": 5, \"8253\": 3, \"2133\": 1, \"2175\": 1, \"2195\": 1, \"2124g\": 8, \"2124\": 3, \"2134\": 2, \"2226ge\": 4, \"2276me\": 3, \"2278ge\": 2, \"2278gel\": 3, \"2288g\": 3, \"1520\": 1, \"1528\": 3, \"1540\": 2, \"1553n\": 1, \"1559\": 2, \"1567\": 2, \"1571\": 1, \"2123it\": 2, \"2166nt\": 2, \"2177nt\": 1, \"bronze\": 5, \"3106\": 1, \"4108\": 2, \"4112\": 1, \"4114t\": 3, \"6138f\": 2, \"6142\": 3, \"6142f\": 2, \"6152\": 4, \"8153\": 1, \"e7\": 142, \"4809\": 6, \"v4\": 289, \"8893\": 4, \"v3\": 118, \"8867\": 1, \"8870\": 3, \"8880l\": 2, \"2870\": 2, \"v2\": 61, \"2890\": 2, \"8890\": 3, \"8850\": 1, \"e5\": 226, \"1620\": 3, \"2609\": 5, \"2623\": 1, \"2630\": 3, \"2680\": 1, \"2695\": 6, \"2699\": 4, \"2699r\": 2, \"4620\": 3, \"4628l\": 1, \"4655\": 2, \"2618l\": 3, \"2628l\": 3, \"2650\": 3, \"2660\": 1, \"2667\": 1, \"2683\": 2, \"4627\": 4, \"4640\": 3, \"1660\": 4, \"2408l\": 1, \"2698\": 3, \"1630\": 3, \"4660\": 5, \"4667\": 1, \"2690\": 4, \"2650l\": 2, \"2470\": 3, \"2430\": 1, \"2407\": 2, \"4603\": 2, \"1501m\": 1, \"1240\": 4, \"1270\": 2, \"1275\": 7, \"1515m\": 5, \"1545m\": 1, \"1585l\": 5, \"1258l\": 1, \"1220l\": 1, \"1230\": 4, \"1230l\": 2, \"1240l\": 1, \"1265l\": 1, \"1275l\": 1, \"1285\": 1, \"1285l\": 2, \"1286\": 3, \"1286l\": 1, \"1105c\": 2, \"1290\": 1, \"5300u\": 2, \"6360u\": 1, \"6600u\": 2, \"7300u\": 2, \"7600u\": 3, \"8350u\": 4, \"8650u\": 4, \"8500t\": 1, \"8600\": 2, \"2186m\": 2, \"i9\": 23, \"9900k\": 3, \"9880h\": 3, \"9900\": 5, \"9900t\": 2, \"9500t\": 1, \"9600\": 1, \"9500\": 1, \"2286m\": 3, \"2276m\": 5, \"greater\": 111, \"supporting\": 111, \"2136\": 4, \"2176m\": 3, \"2236\": 5, \"2278g\": 8, \"1245\": 2, \"1260l\": 2, \"10510y\": 1, \"10710u\": 4, \"9700k\": 5, \"9700te\": 3, \"9750h\": 1, \"8550u\": 2, \"8565u\": 3, \"8569u\": 4, \"8700b\": 2, \"8705g\": 3, \"8750h\": 2, \"8557u\": 2, \"7500u\": 2, \"7700t\": 3, \"7700\": 3, \"7820eq\": 2, \"7920hq\": 2, \"6560u\": 4, \"6567u\": 2, \"6650u\": 3, \"6700t\": 1, \"6785r\": 2, \"sgx\": 113, \"2174g\": 1, \"2244g\": 4, \"2254ml\": 1, \"1575m\": 3, \"9700f\": 4, \"9850h\": 1, \"9900kf\": 3, \"9980hk\": 2, \"8500y\": 2, \"8559u\": 2, \"8700\": 1, \"8709g\": 2, \"8850h\": 1, \"8665ue\": 1, \"7560u\": 3, \"7820hk\": 2, \"6500u\": 1, \"6700\": 2, \"6820hk\": 3, \"6870hq\": 1, \"2224\": 2, \"9900ks\": 2, \"8700k\": 2, \"7700hq\": 3, \"7820hq\": 2, \"7y57\": 1, \"7260u\": 4, \"7287u\": 2, \"7400\": 2, \"7500\": 1, \"7600\": 1, \"7600t\": 1, \"6770hq\": 3, \"6820eq\": 1, \"6970hq\": 2, \"improper\": 384, \"invalidation\": 249, \"table\": 275, \"updates\": 249, \"guest\": 493, \"operating\": 492, \"host\": 531, \"3065\": 1, \"3070\": 1, \"x3330\": 1, \"l3426\": 1, \"x3450\": 1, \"lc3528\": 1, \"ec3539\": 1, \"w3550\": 1, \"w3570\": 1, \"5030\": 1, \"5050\": 2, \"5060\": 1, \"5070\": 1, \"5080\": 1, \"lv\": 2, \"5128\": 1, \"5133\": 1, \"5140\": 1, \"5150\": 1, \"l5238\": 1, \"l5240\": 1, \"l5318\": 1, \"e5335\": 1, \"x5365\": 1, \"e5405\": 1, \"l5408\": 1, \"e5420\": 1, \"l5430\": 1, \"e5462\": 1, \"x5492\": 1, \"e5504\": 1, \"l5518\": 1, \"e5520\": 1, \"l5520\": 1, \"lc5528\": 1, \"e5530\": 2, \"e5540\": 1, \"e5603\": 2, \"l5618\": 1, \"e5640\": 1, \"7030\": 1, \"7041\": 1, \"7120n\": 1, \"7150n\": 1, \"e7220\": 1, \"e7310\": 1, \"e7330\": 1, \"e7420\": 1, \"l7445\": 1, \"l7455\": 1, \"e7450\": 1, \"x7542\": 1, \"3225\": 2, \"3245\": 2, \"2235\": 2, \"2295\": 1, \"1548\": 4, \"1531\": 2, \"1521\": 1, \"1541\": 2, \"1557\": 3, \"1533n\": 3, \"2145nt\": 1, \"1622\": 2, \"1602\": 2, \"2176g\": 1, \"2286g\": 3, \"1241\": 2, \"2630l\": 3, \"2603\": 4, \"2697\": 2, \"2450l\": 1, \"4669\": 6, \"2637\": 1, \"2643\": 2, \"2608l\": 1, \"2620\": 2, \"2658\": 3, \"2687w\": 3, \"2699a\": 3, \"8895\": 1, \"4880\": 1, \"4870\": 1, \"4830\": 1, \"4820\": 3, \"4850\": 1, \"4214\": 3, \"4214y\": 3, \"5215\": 1, \"5218b\": 2, \"5220s\": 3, \"6226\": 3, \"6230n\": 2, \"6230t\": 2, \"6238l\": 1, \"6244\": 3, \"6248\": 1, \"8280l\": 3, \"9221\": 1, \"celeron\": 120, \"g1610\": 1, \"g1820\": 1, \"g1840\": 1, \"g3900t\": 3, \"g3900e\": 1, \"g4900\": 101, \"g4900t\": 1, \"g4920\": 1, \"pentium\": 110, \"4410y\": 1, \"5405u\": 1, \"g5500\": 2, \"g5600t\": 1, \"7820x\": 1, \"9940x\": 1, \"series\": 451, \"9920x\": 1, \"9900x\": 1, \"m\": 14, \"5y10a\": 1, \"5y10\": 1, \"5y10c\": 3, \"m3\": 3, \"6y54\": 1, \"8100y\": 2, \"5557u\": 1, \"5750hq\": 1, \"5850hq\": 2, \"7700k\": 3, \"9700t\": 1, \"5200u\": 2, \"6260u\": 1, \"6200u\": 1, \"7200u\": 2, \"7500t\": 2, \"8250u\": 1, \"8400\": 2, \"8500\": 3, \"8500b\": 1, \"8400b\": 2, \"8265u\": 1, \"9400h\": 1, \"9300h\": 2, \"1035g7\": 1, \"i3\": 23, \"5157u\": 2, \"5010u\": 1, \"6100\": 1, \"6167u\": 1, \"7100t\": 1, \"8145u\": 1, \"9100\": 1, \"9300\": 2, \"10110y\": 1, \"voltage\": 17, \"modulation\": 17, \"some\": 274, \"scalable\": 294, \"4116t\": 1, \"4116\": 1, \"6148\": 3, \"6138\": 2, \"6134m\": 1, \"6134\": 2, \"8180m\": 1, \"8176m\": 1, \"8176f\": 3, \"8164\": 1, \"8160m\": 1, \"leap\": 28, \"opensuse\": 64, \"tsx\": 53, \"asynchronous\": 53, \"abort\": 53, \"cpus\": 53, \"utilizing\": 53, \"speculative\": 53, \"side\": 54, \"channel\": 115, \"9750hf\": 2, \"2245\": 1, \"2265\": 1, \"3245m\": 1, \"4208r\": 1, \"6238\": 3, \"5215r\": 1, \"8256\": 2, \"synergy\": 3, \"660\": 1, \"480\": 3, \"proliant\": 45, \"xl170r\": 3, \"xl230k\": 3, \"xl270d\": 2, \"xl450\": 4, \"ml30\": 1, \"ml110\": 4, \"dl20\": 1, \"dl120\": 4, \"dl160\": 3, \"dl180\": 1, \"dl360\": 3, \"bl460c\": 1, \"apollo\": 3, \"4200\": 3, \"novell\": 10, \"corruption\": 118, \"26\": 202, \"100\": 207, \"6813\": 101, \"dch\": 101, \"6812\": 101, \"2276ml\": 1, \"9700kf\": 1, \"9850he\": 4, \"8086k\": 1, \"8809g\": 3, \"7267u\": 1, \"7440hq\": 2, \"6660u\": 1, \"6920hq\": 1, \"j\": 200, \"n\": 204, \"g3900\": 100, \"atom\": 233, \"e3900\": 100, \"windows\": 3039, \"21\": 110, \"5077\": 200, \"aka15\": 100, \"45\": 100, \"i915\": 100, \"rc7\": 100, \"84\": 100, \"154\": 100, \"201\": 200, \"2146g\": 1, \"2186g\": 1, \"2254me\": 1, \"1585\": 1, \"x5\": 1, \"e3930\": 1, \"x7\": 1, \"e3950\": 1, \"g3902e\": 1, \"g3930\": 1, \"g3930e\": 1, \"g3950\": 1, \"n2805\": 1, \"n2820\": 1, \"n2930\": 1, \"j3060\": 1, \"j3455\": 1, \"j4105\": 1, \"4405u\": 1, \"a1020\": 1, \"d1519\": 1, \"g4600t\": 1, \"g4560t\": 1, \"5y70\": 1, \"5350u\": 1, \"8600k\": 1, \"5020u\": 1, \"6100h\": 1, \"6100u\": 1, \"7100u\": 1, \"7300\": 1, \"7300t\": 1, \"8350k\": 1, \"8100\": 1, \"8109u\": 1, \"8300\": 1, \"9320\": 1, \"9100t\": 1, \"6300hq\": 1, \"7y54\": 3, \"8300h\": 2, \"8400t\": 1, \"10210y\": 1, \"5550u\": 1, \"5775c\": 1, \"8950hk\": 1, \"7980xe\": 1, \"7960x\": 1, \"tus\": 8, \"aus\": 10, \"700\": 29, \"controllers\": 22, \"710\": 603, \"bm1\": 4, \"xxv710\": 6, \"am2\": 2, \"i40e\": 9, \"enternet\": 6, \"x710\": 6, \"bm2\": 2, \"am1\": 4, \"input\": 385, \"validation\": 247, \"at2\": 2, \"tm4\": 2, \"unhandled\": 6, \"exception\": 6, \"ilp60x64\": 1, \"33\": 7, \"unauthenticated\": 75, \"adjacent\": 7, \"authentication\": 89, \"netgear\": 2, \"centria\": 1, \"wndr4700\": 2, \"34\": 1, \"router\": 2, \"apply\": 14, \"cgi\": 1, \"hdd\": 1, \"usr\": 7, \"htm\": 1, \"visited\": 1, \"any\": 57, \"causes\": 28, \"longer\": 1, \"require\": 35, \"administration\": 6, \"portal\": 8, \"letodms\": 6, \"issues\": 12, \"reflected\": 13, \"login\": 4, \"document\": 90, \"owner\": 3, \"calendar\": 3, \"origin\": 31, \"improperly\": 740, \"validated\": 27, \"team\": 2, \"names\": 17, \"attacks\": 40, \"jboss\": 52, \"keycloak\": 14, \"soft\": 9, \"token\": 43, \"deletion\": 9, \"csrf\": 23, \"protocol\": 32, \"blade\": 2, \"shadow\": 6, \"though\": 5, \"take\": 2, \"instance\": 3, \"knowing\": 2, \"victim's\": 3, \"address\": 32, \"packet\": 7, \"injected\": 2, \"unencrypted\": 2, \"udp\": 2, \"stream\": 13, \"samsung\": 21, \"j7\": 2, \"neo\": 4, \"build\": 11, \"fingerprint\": 4, \"j7velteub\": 1, \"j7velte\": 1, \"m1ajq\": 1, \"j701mubs6bsb3\": 1, \"release\": 58, \"keys\": 4, \"pre\": 16, \"installed\": 30, \"app\": 29, \"package\": 10, \"com\": 120, \"themecenter\": 3, \"versioncode\": 4, \"7000100\": 1, \"versionname\": 4, \"apps\": 6, \"perform\": 29, \"installation\": 4, \"accessible\": 3, \"capability\": 4, \"accessed\": 28, \"signatureorsystem\": 3, \"required\": 11, \"exported\": 4, \"their\": 14, \"capabilities\": 7, \"galaxy\": 7, \"j6\": 2, \"j6ltexx\": 1, \"j6lte\": 1, \"r16nw\": 3, \"j600fnxxu3asc1\": 1, \"7000000\": 2, \"s7\": 2, \"hero2ltexx\": 1, \"hero2lte\": 1, \"g935fxxs4esc3\": 1, \"haier\": 2, \"g8\": 3, \"hm\": 1, \"g559\": 1, \"fl\": 1, \"o11019\": 1, \"1522294799\": 1, \"mediatek\": 1, \"wfo\": 1, \"impl\": 1, \"27\": 1, \"co\": 1, \"located\": 3, \"modify\": 1, \"property\": 4, \"authorization\": 18, \"huawei\": 72, \"flaw\": 68, \"all\": 52, \"dpdk\": 8, \"17\": 30, \"16\": 299, \"18\": 20, \"08\": 29, \"malicious\": 124, \"container\": 13, \"vhost\": 8, \"socket\": 8, \"vring\": 8, \"num\": 8, \"resulting\": 61, \"descriptors\": 8, \"virtualization\": 15, \"openstack\": 16, \"sdk\": 8, \"guard\": 1, \"extensions\": 34, \"baseboard\": 16, \"bound\": 106, \"netapp\": 6, \"session\": 102, \"directory\": 32, \"proset\": 4, \"wifi\": 9, \"40\": 8, \"extension\": 8, \"dll\": 106, \"7265\": 2, \"dual\": 1, \"band\": 1, \"ac\": 1, \"wi\": 7, \"fi\": 7, \"ax200\": 2, \"family\": 412, \"ml350\": 2, \"gen9\": 26, \"ml150\": 1, \"xl250a\": 2, \"dl60\": 1, \"dl80\": 2, \"dl380\": 2, \"bl660c\": 3, \"c2530\": 4, \"c2338\": 2, \"c2358\": 1, \"c2518\": 1, \"c2758\": 4, \"c3758\": 1, \"c3708\": 1, \"c3558\": 1, \"c3508\": 2, \"c3338\": 2, \"8891\": 1, \"1680\": 2, \"1537\": 2, \"1577\": 2, \"1529\": 2, \"1523n\": 2, \"1543n\": 1, \"2183it\": 1, \"2141i\": 1, \"1649n\": 1, \"1633n\": 1, \"1627\": 1, \"3204\": 2, \"4109t\": 2, \"6130f\": 1, \"6154\": 1, \"5120\": 2, \"5118\": 1, \"6128\": 2, \"6150\": 1, \"5220t\": 1, \"5215m\": 1, \"6222v\": 1, \"6240m\": 1, \"5220\": 1, \"6212u\": 1, \"6210u\": 2, \"8160f\": 1, \"8170\": 1, \"8168\": 1, \"8260m\": 2, \"8280m\": 1, \"8276m\": 1, \"8276\": 1, \"2nd\": 86, \"xl190r\": 1, \"xl730f\": 1, \"hpe\": 2, \"gen10\": 1, \"c2730\": 2, \"c2718\": 1, \"c3955\": 1, \"c3830\": 1, \"8880\": 1, \"8894\": 1, \"2640\": 2, \"1650\": 2, \"3104\": 2, \"6144\": 2, \"6130t\": 1, \"6136\": 1, \"5120t\": 1, \"5215l\": 1, \"6252\": 1, \"6238t\": 1, \"9282\": 1, \"8276l\": 1, \"moodle\": 32, \"external\": 6, \"enrolment\": 1, \"context\": 2, \"thorough\": 1, \"personal\": 4, \"setting\": 5, \"first\": 4, \"shown\": 4, \"breadcrumbs\": 4, \"course\": 10, \"hidden\": 15, \"courses\": 11, \"being\": 15, \"displayed\": 6, \"tag\": 7, \"results\": 24, \"permission\": 22, \"forum\": 4, \"subscriptions\": 2, \"unenrolled\": 2, \"subscribe\": 2, \"unsubscribe\": 2, \"mod\": 2, \"index\": 197, \"overview\": 5, \"see\": 9, \"gradebook\": 4, \"grade\": 4, \"items\": 4, \"export\": 4, \"repository\": 6, \"repositories\": 4, \"viewable\": 4, \"adobe\": 147, \"illustrator\": 12, \"cc\": 63, \"23\": 21, \"earlier\": 132, \"encoder\": 14, \"bridge\": 22, \"library\": 87, \"hijacking\": 5, \"animate\": 2, \"mcafee\": 2, \"threat\": 53, \"defense\": 53, \"atd\": 1, \"epo\": 1, \"as\": 200, \"administrator\": 21, \"atduser\": 1, \"credentials\": 27, \"too\": 1, \"permissive\": 1, \"sap\": 16, \"netweaver\": 2, \"corrected\": 8, \"30\": 1, \"31\": 52, \"otherwise\": 44, \"restricted\": 6, \"hub\": 1, \"dh\": 1, \"foundation\": 45, \"connection\": 24, \"details\": 1, \"maintained\": 1, \"visible\": 1, \"ui5\": 1, \"handler\": 11, \"ui\": 17, \"51\": 1, \"52\": 90, \"53\": 1, \"54\": 1, \"manipulate\": 3, \"order\": 7, \"processing\": 99, \"erp\": 4, \"sales\": 6, \"appl\": 2, \"s4hana\": 2, \"s4core\": 2, \"does\": 109, \"businessobjects\": 2, \"business\": 5, \"intelligence\": 3, \"platform\": 14, \"publication\": 1, \"pages\": 28, \"exploit\": 263, \"thunar\": 6, \"pasting\": 6, \"format\": 76, \"suse\": 4, \"rsyslog\": 22, \"way\": 209, \"deamon\": 22, \"processed\": 22, \"rulesets\": 16, \"output\": 27, \"batches\": 16, \"contained\": 16, \"belonging\": 32, \"more\": 32, \"than\": 97, \"one\": 39, \"ruleset\": 32, \"rsyslogd\": 22, \"message\": 93, \"repeatedmsgreduction\": 6, \"crashing\": 6, \"repeated\": 6, \"sent\": 10, \"within\": 39, \"short\": 6, \"periods\": 6, \"sqldriverconnect\": 7, \"unixodbc\": 7, \"14p2\": 7, \"specifying\": 7, \"large\": 16, \"value\": 43, \"savefile\": 7, \"tesseract\": 3, \"rewrite\": 3, \"guessing\": 3, \"creating\": 3, \"user's\": 16, \"v86d\": 1, \"verify\": 11, \"received\": 50, \"netlink\": 1, \"video\": 21, \"consequences\": 1, \"phpbb\": 1, \"flash\": 2, \"bb\": 1, \"trac\": 3, \"properly\": 615, \"workflow\": 3, \"modifying\": 3, \"ticket\": 3, \"change\": 18, \"status\": 4, \"resolution\": 3, \"tickets\": 3, \"having\": 3, \"consolekit\": 8, \"intended\": 22, \"restriction\": 8, \"escalate\": 17, \"initiating\": 8, \"vnc\": 8, \"udisks\": 6, \"load\": 10, \"modules\": 98, \"php5\": 9, \"passing\": 19, \"utf\": 9, \"strings\": 9, \"xmltextwriterwriteattribute\": 9, \"then\": 43, \"misparsed\": 9, \"libxml2\": 9, \"bootloader\": 2, \"command\": 36, \"sanitization\": 2, \"elevation\": 1574, \"80316910\": 2, \"broadcom\": 5, \"130375182\": 5, \"qmi\": 4, \"vs\": 4, \"139148442\": 4, \"model\": 4, \"acrn\": 6, \"2019w25\": 3, \"140000p\": 3, \"relies\": 5, \"assert\": 45, \"calls\": 34, \"devicemodel\": 6, \"include\": 6, \"h\": 8, \"instead\": 5, \"mechanisms\": 5, \"propagating\": 3, \"diagnostic\": 11, \"might\": 175, \"assertion\": 4, \"crun\": 4, \"doesn't\": 4, \"correctly\": 15, \"whether\": 4, \"target\": 12, \"symlink\": 9, \"outside\": 14, \"libcrun\": 8, \"chroot\": 4, \"realpath\": 4, \"poppler\": 5, \"malformed\": 8, \"internal\": 5, \"stack\": 87, \"integer\": 81, \"occur\": 104, \"parsing\": 183, \"charcodes\": 2, \"fonts\": 79, \"offlineimap\": 7, \"added\": 5, \"support\": 155, \"ssl\": 26, \"certificate\": 108, \"but\": 9, \"still\": 4, \"flawed\": 4, \"deficiencies\": 4, \"getusercount\": 5, \"getcount\": 5, \"userswitchercontroller\": 5, \"new\": 46, \"logic\": 8, \"who\": 36, \"physical\": 8, \"140486529\": 5, \"motorola\": 3, \"bta\": 4, \"dmpinreply\": 2, \"dm\": 4, \"incorrect\": 25, \"139287605\": 2, \"v8\": 4, \"jit\": 2, \"bug\": 14, \"9android\": 9, \"138441919\": 2, \"nfa\": 10, \"hci\": 10, \"handle\": 315, \"admin\": 20, \"gate\": 5, \"rsp\": 5, \"act\": 5, \"124524315\": 5, \"rw\": 14, \"i93\": 14, \"sm\": 7, \"over\": 46, \"nfc\": 7, \"139188579\": 7, \"proxyresolverv8\": 2, \"setpacscript\": 2, \"proxy\": 2, \"resolver\": 6, \"139806216\": 2, \"findsharedfunctioninfo\": 7, \"objects\": 652, \"mistake\": 7, \"ast\": 7, \"traversal\": 9, \"pacprocessor\": 7, \"138442295\": 7, \"cryptoplugin\": 18, \"decrypt\": 13, \"cpp\": 21, \"137370777\": 5, \"137283376\": 4, \"generate\": 4, \"jsimd\": 8, \"ycc\": 4, \"rgb\": 4, \"convert\": 6, \"neon\": 8, \"arm64\": 4, \"s\": 80, \"120551338\": 4, \"ubuntu\": 27, \"canonical\": 25, \"createsessioninternal\": 6, \"packageinstallerservice\": 6, \"138650665\": 6, \"download\": 18, \"provider\": 8, \"135270103\": 3, \"processphonebookaccess\": 4, \"cachedbluetoothdevice\": 4, \"contact\": 4, \"list\": 93, \"138529441\": 4, \"135269143\": 5, \"tokenize\": 2, \"sqlite3\": 2, \"controlled\": 2, \"statement\": 2, \"139186193\": 2, \"welcomeactivity\": 8, \"partially\": 10, \"provisioned\": 8, \"client\": 60, \"leaving\": 8, \"indication\": 11, \"132261064\": 8, \"call\": 82, \"sliceprovider\": 4, \"138441555\": 4, \"oktoconnect\": 1, \"hidhostservice\": 1, \"state\": 8, \"79703832\": 1, \"yes\": 3, \"option\": 6, \"specified\": 7, \"man\": 18, \"middle\": 18, \"products\": 207, \"abnormal\": 18, \"srg2300\": 3, \"ar3600\": 3, \"ar3200\": 3, \"ar2200\": 1, \"ar150\": 4, \"ar120\": 3, \"handling\": 33, \"operation\": 10, \"specific\": 54, \"continuously\": 10, \"srg3300\": 1, \"vdsm\": 12, \"vdsclient\": 8, \"validate\": 285, \"certficate\": 6, \"hostname\": 9, \"another\": 20, \"facilitate\": 6, \"honor\": 9, \"lite\": 3, \"8a\": 6, \"y6\": 3, \"mobile\": 635, \"phones\": 10, \"217\": 3, \"c00e215r3p1\": 3, \"205\": 613, \"c00e97r1p9\": 3, \"c00e97r2p2\": 3, \"records\": 3, \"p30\": 10, \"smart\": 4, \"elle\": 7, \"al00b\": 7, \"193\": 3, \"c00e190r2p1\": 3, \"tricks\": 13, \"installing\": 13, \"obtains\": 2, \"root\": 8, \"constructs\": 2, \"camera\": 14, \"program\": 4, \"break\": 2, \"down\": 2, \"bastet\": 9, \"smartphones\": 14, \"emily\": 56, \"al00a\": 12, \"182\": 18, \"c00e82r1p21\": 9, \"tl00b\": 11, \"c01e82r1p21\": 9, \"l09c\": 11, \"203\": 18, \"c432e7r1p11\": 18, \"l29c\": 24, \"202\": 9, \"c185e2r1p12\": 9, \"double\": 34, \"frees\": 9, \"same\": 25, \"twice\": 9, \"hima\": 3, \"l29ca\": 2, \"311\": 10, \"c10e2r1p13t8\": 2, \"c461e2r1p11t8\": 2, \"316\": 2, \"c635e2r1p11t8\": 2, \"c185e2r1p12t8\": 2, \"c605e2r1p12t8\": 2, \"c636e7r1p13t8\": 2, \"leakage\": 4, \"sdcard\": 2, \"fribidi\": 15, \"par\": 3, \"embedding\": 3, \"levels\": 3, \"ex\": 3, \"lib\": 3, \"bidi\": 3, \"gnu\": 12, \"delivering\": 3, \"text\": 57, \"rendered\": 3, \"uses\": 36, \"layout\": 9, \"calculations\": 3, \"examples\": 3, \"gnome\": 4, \"gtk\": 3, \"based\": 50, \"pango\": 3, \"internally\": 3, \"bidirectional\": 3, \"example\": 5, \"construct\": 3, \"opened\": 3, \"gedit\": 3, \"viewed\": 3, \"hexchat\": 3, \"109\": 1, \"c00e106r1p21\": 1, \"113\": 1, \"c00e110r1p21\": 1, \"125\": 19, \"c00e120r1p21\": 1, \"135\": 1, \"c00e130r1p21\": 1, \"153\": 1, \"c00e150r1p21\": 2, \"155\": 1, \"162\": 1, \"c00e160r2p1\": 1, \"verification\": 6, \"sufficiently\": 3, \"should\": 6, \"phone\": 2, \"high\": 159, \"launch\": 9, \"dos\": 76, \"186\": 2, \"c00e180r2p1\": 2, \"incorrectly\": 4, \"attempts\": 3, \"p20\": 3, \"pro\": 8, \"mate\": 1, \"rs\": 81, \"charlotte\": 1, \"321\": 3, \"c00e320r1p1t8\": 2, \"al00d\": 1, \"al00\": 1, \"c786e320r1p1t8\": 1, \"models\": 50, \"trick\": 6, \"craft\": 3, \"tamper\": 62, \"mysql\": 31, \"gui\": 11, \"tools\": 15, \"query\": 10, \"browser\": 6, \"0r14\": 2, \"exposes\": 5, \"connected\": 2, \"clear\": 10, \"running\": 16, \"brms\": 3, \"asset\": 6, \"uuid\": 3, \"rules\": 3, \"party\": 5, \"webkit\": 55, \"webcore\": 15, \"svg\": 6, \"animation\": 10, \"svgsmilelement\": 5, \"chrome\": 60, \"blink\": 100, \"m11\": 24, \"m12\": 29, \"trying\": 5, \"removed\": 5, \"smil\": 5, \"element\": 5, \"counter\": 5, \"nodes\": 5, \"unchecked\": 4, \"sscanf\": 4, \"ettercap\": 4, \"settings\": 12, \"static\": 9, \"sized\": 4, \"babiloo\": 2, \"predictable\": 2, \"downloading\": 19, \"unpacking\": 5, \"dictionary\": 10, \"allowing\": 90, \"overwrite\": 74, \"bios\": 183, \"detection\": 69, \"mechanism\": 64, \"lenovo\": 301, \"thinkpad\": 145, \"t460p\": 61, \"up\": 140, \"r07et90w\": 61, \"t470p\": 61, \"r0fet50w\": 61, \"unauthorized\": 76, \"thinksystem\": 1, \"hr630x\": 1, \"skl\": 1, \"x380\": 2, \"yoga\": 12, \"x250\": 1, \"x140e\": 1, \"s5\": 2, \"p52\": 1, \"p51s\": 1, \"l490\": 1, \"helix\": 1, \"11e\": 3, \"4th\": 2, \"gen\": 7, \"zhaoyang\": 3, \"k42\": 3, \"80\": 10, \"520\": 2, \"14ikb\": 20, \"v510\": 4, \"v330\": 11, \"14isk\": 9, \"v310\": 10, \"15isk\": 5, \"15ikb\": 2, \"v110\": 1, \"s540\": 3, \"15iwl\": 7, \"14iwl\": 6, \"legion\": 10, \"y9000k\": 1, \"y730\": 3, \"17ich\": 1, \"15ich\": 3, \"y530\": 1, \"flex\": 7, \"e52\": 6, \"340c\": 2, \"330c\": 1, \"thinkcentre\": 29, \"m8350z\": 2, \"m800z\": 2, \"e95z\": 1, \"a340\": 4, \"24icb\": 1, \"24\": 37, \"yangtian\": 5, \"ytm6900e\": 2, \"00\": 7, \"ms\": 1, \"h81\": 2, \"m920q\": 1, \"m8500s\": 1, \"m8500t\": 1, \"m720t\": 1, \"m715q\": 3, \"rr\": 1, \"m710t\": 2, \"m4500k\": 1, \"ideacentre\": 4, \"310s\": 1, \"08igm\": 1, \"300\": 1, \"20ish\": 1, \"potential\": 192, \"smi\": 49, \"callback\": 49, \"thinkstation\": 3, \"p330\": 1, \"tiny\": 2, \"p300\": 1, \"x260\": 1, \"t570\": 1, \"t480s\": 1, \"t480\": 1, \"t460s\": 1, \"s1\": 1, \"p72\": 1, \"p50s\": 1, \"l560\": 1, \"l460\": 1, \"l380\": 1, \"e570\": 1, \"730\": 580, \"13iwl\": 1, \"xx\": 1, \"chao5000\": 1, \"ikbra\": 1, \"xiaoxin\": 4, \"air\": 4, \"wei5\": 1, \"touch\": 1, \"y740\": 2, \"17ichg\": 1, \"l340\": 1, \"15irh\": 1, \"e42\": 1, \"330\": 2, \"15ikbr\": 1, \"qt\": 2, \"a7400\": 1, \"afh110\": 1, \"s510\": 1, \"m73p\": 1, \"m700t\": 1, \"e74s\": 1, \"e73\": 1, \"qitian\": 3, \"b4550\": 2, \"m4550\": 1, \"y520t\": 1, \"z370\": 1, \"t530\": 1, \"28icb\": 1, \"c730\": 1, \"19ico\": 1, \"300s\": 2, \"11ish\": 2, \"thinkpads\": 58, \"circumstances\": 100, \"p320\": 1, \"x240\": 1, \"t540p\": 1, \"t450s\": 1, \"p73\": 1, \"p1\": 6, \"s2\": 2, \"3rd\": 2, \"r490\": 1, \"e490s\": 1, \"e550c\": 1, \"e550\": 1, \"e450\": 1, \"yoga530\": 1, \"s940\": 1, \"s340\": 1, \"v720\": 1, \"17irhg\": 1, \"530s\": 2, \"v530\": 1, \"22icb\": 1, \"yt\": 2, \"s4350\": 1, \"v310z\": 1, \"s3150\": 1, \"m9500z\": 1, \"m910z\": 1, \"m700z\": 1, \"aio520\": 2, \"24ikl\": 1, \"22ikl\": 1, \"wf\": 1, \"m725s\": 1, \"m700q\": 1, \"m6600s\": 1, \"m6600q\": 1, \"e73s\": 2, \"m415\": 1, \"4500\": 1, \"v530s\": 1, \"07icb\": 1, \"m4500\": 1, \"renderlayerwhen\": 5, \"removing\": 5, \"elements\": 5, \"reflections\": 5, \"encrypt\": 3, \"ruby\": 4, \"rails\": 3, \"padding\": 3, \"bad\": 8, \"phishing\": 11, \"sites\": 3, \"scripts\": 3, \"mailscanner\": 8, \"79\": 4, \"downloads\": 3, \"trusts\": 3, \"them\": 4, \"encryption\": 4, \"g\": 13, \"https\": 99, \"checking\": 54, \"whitelist\": 3, \"spoofing\": 33, \"incomplete\": 8, \"fix\": 3, \"cve\": 3906, \"2008\": 179, \"5313\": 1, \"feature\": 226, \"office\": 146, \"enforcing\": 5, \"macro\": 5, \"excel\": 132, \"'microsoft\": 271, \"bypass'\": 5, \"cybozu\": 1, \"handles\": 628, \"opentype\": 74, \"'opentype\": 97, \"font\": 123, \"vulnerability'\": 1707, \"unique\": 996, \"1419\": 38, \"2016\": 375, \"2012\": 168, \"rt\": 136, \"click\": 9, \"run\": 33, \"c2r\": 9, \"components\": 16, \"standard\": 37, \"appcontainer\": 9, \"sandbox\": 9, \"lpac\": 9, \"clicktorun\": 9, \"365\": 12, \"proplus\": 9, \"fails\": 570, \"online\": 37, \"communications\": 60, \"handlers\": 11, \"1445\": 3, \"discloses\": 188, \"contents\": 170, \"services\": 231, \"sharepoint\": 82, \"1447\": 8, \"uploads\": 12, \"successfully\": 32, \"leverage\": 14, \"smb\": 17, \"hashes\": 17, \"addresses\": 23, \"correcting\": 23, \"how\": 48, \"urls\": 12, \"victim\": 103, \"entering\": 6, \"embedded\": 3, \"'win32k\": 247, \"win32k\": 217, \"provides\": 25, \"1436\": 9, \"gdi\": 82, \"'windows\": 833, \"1407\": 133, \"1433\": 132, \"1435\": 140, \"1437\": 165, \"1438\": 142, \"1440\": 13, \"1393\": 190, \"1394\": 173, \"1395\": 180, \"1396\": 177, \"1408\": 195, \"directwrite\": 68, \"'directwrite\": 68, \"1411\": 27, \"parses\": 16, \"quicktime\": 16, \"rights\": 16, \"engine\": 215, \"internet\": 26, \"explorer\": 25, \"'scripting\": 35, \"1426\": 23, \"1427\": 29, \"1428\": 28, \"1429\": 25, \"chakracore\": 15, \"visual\": 30, \"studio\": 46, \"hardlinks\": 15, \"while\": 300, \"extracting\": 15, \"archived\": 15, \"'visual\": 15, \"2017\": 9, \"netlogon\": 87, \"secure\": 66, \"'netlogon\": 49, \"starttiledata\": 5, \"locations\": 42, \"1420\": 49, \"1422\": 32, \"iphlpsvc\": 44, \"1423\": 71, \"dssvc\": 27, \"secured\": 27, \"location\": 40, \"1456\": 36, \"installer\": 267, \"sharing\": 57, \"1379\": 20, \"1383\": 14, \"filesystem\": 34, \"atmfd\": 23, \"1432\": 41, \"procedure\": 72, \"rpc\": 36, \"initializes\": 36, \"1434\": 195, \"jet\": 39, \"database\": 80, \"'jet\": 39, \"universal\": 36, \"plug\": 36, \"play\": 36, \"upnp\": 72, \"object\": 36, \"hyper\": 440, \"v\": 486, \"0712\": 65, \"1309\": 81, \"1310\": 86, \"1389\": 64, \"1397\": 55, \"1398\": 73, \"12207\": 37, \"vbscript\": 5, \"'vbscript\": 5, \"dialog\": 92, \"enforce\": 46, \"appx\": 33, \"deployment\": 33, \"need\": 11, \"elevate\": 11, \"manages\": 11, \"sign\": 44, \"1417\": 18, \"activex\": 78, \"servicing\": 37, \"splwow64\": 50, \"exe\": 25, \"reporting\": 40, \"wer\": 20, \"exchange\": 30, \"deserialization\": 6, \"metadata\": 9, \"powershell\": 6, \"enclave\": 9, \"'open\": 3, \"development\": 3, \"kit\": 3, \"tcp\": 53, \"ipv6\": 15, \"flowlabel\": 15, \"filled\": 15, \"packets\": 28, \"switch\": 117, \"1399\": 71, \"azure\": 8, \"'azure\": 4, \"'hyper\": 46, \"0719\": 15, \"0721\": 31, \"cssselector\": 4, \"causing\": 4, \"alien\": 4, \"arena\": 4, \"supplying\": 4, \"libpoe\": 10, \"perl\": 10, \"32\": 10, \"remove\": 10, \"carriage\": 10, \"returns\": 10, \"line\": 10, \"feeds\": 10, \"argument\": 23, \"such\": 12, \"rquit\": 10, \"'privmsg'\": 10, \"ld\": 2, \"undefined\": 2, \"gargoyle\": 4, \"2009\": 2, \"25\": 5, \"variable\": 26, \"will\": 20, \"point\": 2, \"cracked\": 2, \"libgarglk\": 2, \"account\": 6, \"hitachi\": 3, \"suite\": 2, \"trigger\": 9, \"uncontrolled\": 4, \"replication\": 1, \"emc\": 1, \"keystone\": 8, \"extremely\": 4, \"long\": 5, \"exhausting\": 4, \"space\": 4, \"ibm\": 111, \"spectrum\": 6, \"protect\": 6, \"plus\": 7, \"restored\": 3, \"directories\": 8, \"actions\": 6, \"force\": 37, \"170963\": 3, \"atop\": 3, \"tempfile\": 3, \"istio\": 3, \"continue\": 1, \"listener\": 1, \"filters\": 1, \"18836\": 1, \"statusnet\": 2, \"gdk\": 5, \"pixbuf\": 5, \"gif\": 5, \"initializing\": 5, \"decompression\": 23, \"tables\": 5, \"alphanetworks\": 3, \"telnet\": 3, \"etc\": 8, \"alpha\": 3, \"dir\": 25, \"600\": 230, \"b1\": 4, \"ww\": 3, \"890l\": 3, \"a1\": 12, \"v1\": 19, \"615\": 287, \"j1\": 3, \"v100\": 3, \"dcn\": 3, \"645\": 3, \"815\": 3, \"823\": 3, \"842\": 5, \"c1\": 5, \"dlink\": 2, \"liboping\": 5, \"upon\": 9, \"r390\": 1, \"panel\": 1, \"loads\": 1, \"dlls\": 1, \"validating\": 1, \"also\": 6, \"known\": 5, \"planting\": 1, \"preloading\": 1, \"requires\": 1, \"cognos\": 40, \"embed\": 14, \"javascript\": 18, \"thus\": 15, \"altering\": 14, \"leading\": 42, \"trusted\": 17, \"170881\": 7, \"qradar\": 26, \"patch\": 10, \"167239\": 3, \"event\": 10, \"advisor\": 6, \"blacklisting\": 3, \"controls\": 3, \"direct\": 3, \"integrity\": 7, \"166205\": 3, \"watson\": 3, \"164430\": 4, \"163779\": 1, \"163618\": 2, \"i\": 3, \"163492\": 1, \"stores\": 5, \"logs\": 3, \"referrer\": 3, \"history\": 4, \"162659\": 3, \"easy\": 4, \"guess\": 4, \"identifier\": 4, \"162658\": 4, \"reveal\": 3, \"future\": 7, \"against\": 6, \"161271\": 3, \"xml\": 28, \"entity\": 5, \"expose\": 4, \"make\": 3, \"domains\": 5, \"147369\": 3, \"medtronic\": 2, \"valleylab\": 3, \"ft10\": 2, \"energy\": 3, \"vlft10gen\": 1, \"lower\": 3, \"ls10\": 1, \"vlls10gen\": 1, \"available\": 84, \"united\": 1, \"states\": 1, \"rfid\": 2, \"implementation\": 5, \"underlies\": 1, \"python\": 10, \"implementations\": 1, \"arrow\": 3, \"had\": 3, \"uninitialized\": 58, \"building\": 1, \"arrays\": 2, \"null\": 47, \"values\": 3, \"cases\": 1, \"unintentionally\": 1, \"shared\": 1, \"transmitted\": 1, \"wire\": 1, \"flight\": 1, \"persisted\": 1, \"streaming\": 4, \"ipc\": 3, \"formats\": 1, \"exposure\": 8, \"mistral's\": 3, \"undercloud\": 3, \"containing\": 5, \"made\": 3, \"world\": 8, \"readable\": 8, \"mistral\": 3, \"syndesis\": 8, \"origins\": 5, \"lack\": 98, \"conduct\": 9, \"further\": 5, \"fuse\": 2, \"'deref'\": 2, \"389\": 7, \"ds\": 2, \"'search'\": 2, \"attribute\": 2, \"configurations\": 2, \"private\": 8, \"attributes\": 15, \"ceph\": 7, \"rgw\": 6, \"beast\": 2, \"front\": 2, \"end\": 3, \"valid\": 53, \"headers\": 15, \"terminating\": 2, \"clients\": 2, \"hibernate\": 5, \"validator\": 16, \"safehtml\": 5, \"annotation\": 5, \"sanitize\": 5, \"payloads\": 33, \"consisting\": 5, \"comments\": 5, \"instructions\": 5, \"grid\": 1, \"tuned's\": 7, \"ktune\": 7, \"atlassian\": 10, \"troubleshooting\": 4, \"initiate\": 4, \"periodic\": 4, \"scans\": 4, \"email\": 16, \"contain\": 23, \"about\": 35, \"included\": 6, \"bitbucket\": 4, \"center\": 79, \"confluence\": 4, \"jira\": 8, \"crowd\": 8, \"fisheye\": 5, \"crucible\": 5, \"bamboo\": 6, \"gri\": 2, \"generates\": 2, \"jon\": 2, \"sp1\": 2, \"mantisbt\": 1, \"reporter\": 1, \"gambas\": 1, \"move\": 1, \"frysk\": 8, \"packages\": 5, \"shipped\": 8, \"red\": 16, \"hat\": 16, \"built\": 4, \"rpath\": 4, \"elf\": 4, \"binaries\": 4, \"bin\": 4, \"f\": 7, \"fcore\": 4, \"fcatch\": 4, \"fstack\": 4, \"fstep\": 4, \"lintian\": 11, \"gather\": 8, \"symlinks\": 8, \"viewvc\": 1, \"forbidden\": 1, \"ldap\": 11, \"git\": 3, \"backup\": 7, \"keygen\": 2, \"sh\": 2, \"shibboleth\": 4, \"sp\": 4, \"openssl\": 3, \"des\": 2, \"placed\": 2, \"umask\": 2, \"chmoding\": 2, \"itself\": 2, \"generated\": 2, \"tahoe\": 4, \"lafs\": 4, \"ensure\": 42, \"mutable\": 4, \"retrieval\": 4, \"openttd\": 4, \"slow\": 4, \"prevents\": 4, \"joining\": 4, \"wrong\": 5, \"strlen\": 5, \"64\": 5, \"bit\": 5, \"platforms\": 5, \"clearing\": 5, \"lists\": 5, \"animationcontrollerprivate\": 5, \"signal\": 5, \"hardware\": 5, \"starts\": 5, \"drupal\": 3, \"supplied\": 5, \"timer\": 8, \"m13\": 7, \"documentloader\": 3, \"documentwriter\": 3, \"replacedocument\": 3, \"clocksource\": 6, \"non\": 38, \"generic\": 4, \"accessing\": 59, \"clocksource0\": 2, \"oops\": 2, \"aa\": 4, \"label\": 2, \"parse\": 38, \"audit\": 4, \"rule\": 2, \"apparmor\": 2, \"dwc3\": 3, \"properties\": 21, \"9bbfceea12a8\": 1, \"sof\": 8, \"dfsentry\": 1, \"sound\": 3, \"soc\": 3, \"debug\": 3, \"c0a333d842ef\": 1, \"params\": 2, \"45c1380358b1\": 2, \"komeda\": 6, \"wb\": 4, \"connector\": 6, \"arm\": 3, \"writeback\": 2, \"a0ecd6fdbf5d\": 2, \"af9005\": 6, \"identify\": 3, \"dvb\": 3, \"2289adbfa559\": 3, \"ccp\": 6, \"sha\": 2, \"ops\": 2, \"128c66429247\": 2, \"sja1105\": 8, \"upload\": 5, \"dsa\": 2, \"inhibit\": 2, \"tx\": 20, \"68501df92d11\": 2, \"ql\": 2, \"buffers\": 2, \"qlogic\": 2, \"qla3xxx\": 2, \"mapping\": 3, \"1acb8f2a7a9f\": 2, \"printers\": 84, \"listed\": 42, \"maliciously\": 55, \"print\": 42, \"inkjet\": 42, \"printer\": 42, \"produces\": 42, \"k9z76b\": 1, \"k9z76a\": 1, \"d3q21d\": 2, \"d3q21b\": 1, \"k9z74d\": 2, \"k9z74a\": 3, \"d3q17d\": 3, \"d3q17a\": 1, \"2dr21d\": 2, \"w2z53b\": 4, \"d3q20c\": 2, \"d3q20a\": 1, \"d3q19b\": 2, \"d3q16d\": 2, \"d3q16a\": 1, \"d3q15a\": 2, \"j9v82d\": 1, \"j9v82a\": 1, \"j6u51b\": 2, \"j6u55d\": 1, \"j6u55a\": 1, \"j9v80b\": 1, \"j6u57a\": 2, \"t0g70a\": 2, \"d9l63a\": 1, \"ipv4\": 12, \"sysctl\": 3, \"signed\": 6, \"ack\": 3, \"rtt\": 6, \"userspace\": 8, \"writes\": 16, \"very\": 5, \"proc\": 3, \"min\": 3, \"wlen\": 3, \"19fad20d15a6\": 3, \"customer\": 2, \"filter\": 1, \"desk\": 5, \"projects\": 1, \"'anyone\": 1, \"raise\": 1, \"portal'\": 1, \"grant\": 1, \"themselves\": 1, \"s8\": 1, \"number\": 15, \"g955usqu5crg3\": 2, \"baseband\": 6, \"vendor\": 16, \"qualcomm\": 1153, \"snapdragon\": 4914, \"835\": 576, \"s3\": 1, \"jss15j\": 2, \"i9300xxugnd5\": 1, \"exynos\": 2, \"4412\": 2, \"i9300xxugna8\": 1, \"i9300xugnd5\": 1, \"n7100ddufnd1\": 1, \"bluetooth\": 1, \"several\": 1, \"systemd\": 6, \"239\": 3, \"243\": 3, \"accepts\": 3, \"authority\": 3, \"tls\": 13, \"sni\": 3, \"gnutls\": 3, \"backend\": 13, \"cxf\": 10, \"fully\": 3, \"fledged\": 3, \"openid\": 3, \"principal\": 3, \"equal\": 15, \"clientid\": 3, \"somehow\": 3, \"steal\": 3, \"issued\": 3, \"they\": 8, \"restrict\": 2, \"attachments\": 6, \"present\": 2, \"given\": 2, \"leaves\": 2, \"possibility\": 4, \"crafts\": 2, \"releases\": 3, \"limit\": 2, \"enforced\": 2, \"configurable\": 2, \"attachment\": 12, \"max\": 2, \"count\": 15, \"magento\": 31, \"injecting\": 1, \"website\": 1, \"backport\": 1, \"3137\": 2, \"leads\": 73, \"1858\": 1, \"dfsg\": 4, \"deb8u15\": 1, \"deb8u18\": 1, \"p4\": 2, \"deb9u5\": 1, \"isc\": 1, \"distributions\": 1, \"did\": 1, \"similar\": 1, \"backports\": 1, \"typo3\": 27, \"frontend\": 1, \"box\": 1, \"ovirt\": 25, \"power\": 13, \"cleartext\": 9, \"administrators\": 5, \"hosts\": 5, \"description\": 4, \"vms\": 8, \"portion\": 4, \"appears\": 37, \"fixed\": 6, \"invalidate\": 1, \"restapi\": 1, \"logout\": 1, \"webadmin\": 1, \"knowledge\": 4, \"replacing\": 1, \"forgery\": 2, \"beta2\": 1, \"hijack\": 4, \"rest\": 1, \"versionmapper\": 4, \"fromkernelversionstring\": 4, \"method\": 16, \"compat\": 12, \"os\": 18, \"restart\": 6, \"syscall\": 22, \"restarting\": 6, \"nanosleep\": 6, \"unreachable\": 21, \"jsp\": 8, \"mumble\": 4, \"murmur\": 4, \"burn\": 5, \"mishandled\": 7, \"quotation\": 5, \"marks\": 5, \"pagure\": 14, \"macos\": 6, \"graphicscontext\": 6, \"fillrect\": 6, \"console\": 7, \"drupal6\": 4, \"redirection\": 4, \"webapp\": 3, \"snoop\": 3, \"docutils\": 1, \"usage\": 1, \"amphora\": 2, \"images\": 2, \"octavia\": 2, \"anyone\": 2, \"retrieve\": 2, \"9443\": 2, \"py\": 2, \"gunicorn\": 2, \"cert\": 4, \"reqs\": 2, \"supposed\": 2, \"extract\": 77, \"group\": 38, \"icon\": 38, \"cursor\": 38, \"wrestool\": 45, \"icoutils\": 45, \"unallocated\": 20, \"executable\": 45, \"workstation\": 22, \"eus\": 6, \"postgresql\": 3, \"bundled\": 1, \"executing\": 1, \"unprotected\": 1, \"vsdm\": 6, \"storage\": 11, \"xen\": 5, \"x86\": 2, \"pv\": 2, \"vcpuop\": 3, \"initialise\": 3, \"hypercall\": 3, \"continuation\": 2, \"variadic\": 1, \"printf\": 1, \"like\": 1, \"interpret\": 1, \"character\": 2, \"done\": 1, \"crashes\": 1, \"hit\": 1, \"executes\": 1, \"period\": 1, \"created\": 14, \"guests\": 4, \"hypervisor\": 1, \"newer\": 1, \"hvm\": 1, \"pvh\": 1, \"citrix\": 1, \"joomla\": 3, \"phputf8\": 1, \"fmt\": 6, \"sdr\": 6, \"reserved\": 3, \"rcar\": 6, \"drif\": 6, \"cap\": 3, \"problem\": 3, \"authenticates\": 1, \"specification\": 1, \"knot\": 2, \"downgrade\": 2, \"dnssec\": 4, \"opening\": 35, \"payload\": 61, \"size\": 120, \"auto\": 620, \"compute\": 481, \"consumer\": 707, \"iot\": 1560, \"industrial\": 628, \"voice\": 583, \"music\": 583, \"wearables\": 586, \"mdm9150\": 376, \"mdm9206\": 512, \"mdm9607\": 541, \"mdm9615\": 122, \"mdm9640\": 380, \"mdm9650\": 422, \"msm8909w\": 605, \"msm8996au\": 578, \"qcs405\": 424, \"qcs605\": 532, \"215\": 520, \"sd\": 15551, \"210\": 600, \"212\": 603, \"425\": 619, \"427\": 532, \"430\": 503, \"435\": 532, \"439\": 563, \"429\": 562, \"450\": 634, \"415\": 293, \"625\": 633, \"632\": 553, \"636\": 576, \"665\": 560, \"675\": 578, \"712\": 596, \"670\": 600, \"820\": 552, \"820a\": 565, \"845\": 614, \"850\": 608, \"855\": 593, \"sda660\": 579, \"sdm439\": 562, \"sdm630\": 574, \"sdm660\": 586, \"sdx20\": 516, \"sdx24\": 356, \"subtracting\": 27, \"integers\": 27, \"boundary\": 46, \"adsp\": 97, \"array\": 99, \"compromised\": 51, \"audio\": 45, \"range\": 21, \"connectivity\": 209, \"passed\": 67, \"initialized\": 38, \"bus\": 38, \"corrupted\": 62, \"finally\": 13, \"electronics\": 79, \"apq8017\": 13, \"apq8053\": 17, \"apq8096au\": 13, \"mdm9207c\": 16, \"msm8905\": 18, \"msm8909\": 16, \"msm8976\": 14, \"qca6174a\": 60, \"qca6574au\": 186, \"qca9377\": 61, \"qca9379\": 59, \"qcn7605\": 16, \"sda845\": 13, \"sdm636\": 13, \"sdm670\": 13, \"sdm710\": 16, \"sdm845\": 16, \"sm6150\": 14, \"sm8150\": 14, \"observed\": 20, \"giving\": 20, \"far\": 20, \"playing\": 68, \"8cx\": 141, \"med\": 157, \"sxr1130\": 168, \"rx\": 18, \"fifo\": 18, \"calculating\": 18, \"pointer\": 90, \"deserializing\": 18, \"blob\": 18, \"exposing\": 19, \"partial\": 18, \"invoked\": 18, \"depends\": 18, \"13907\": 18, \"wired\": 85, \"infrastructure\": 91, \"networking\": 85, \"mdm9205\": 48, \"qcs404\": 19, \"410\": 18, \"650\": 95, \"652\": 5, \"oob\": 27, \"mmcp\": 27, \"mdm9625\": 28, \"mdm9635m\": 27, \"mdm9655\": 28, \"ipq8074\": 68, \"qca8081\": 17, \"thread\": 19, \"start\": 16, \"since\": 43, \"qca6574\": 13, \"happen\": 35, \"sensor\": 3, \"freed\": 29, \"try\": 3, \"chunk\": 17, \"doesn\": 17, \"match\": 17, \"dereference\": 78, \"flv\": 32, \"clip\": 80, \"codec\": 32, \"super\": 19, \"entry\": 63, \"allocated\": 19, \"increased\": 4, \"attempting\": 18, \"mark\": 18, \"dirty\": 36, \"616\": 2, \"mdlog\": 13, \"closing\": 13, \"negative\": 26, \"clk\": 52, \"wrongly\": 26, \"interpreted\": 26, \"nonstandard\": 64, \"dci\": 13, \"preemptively\": 13, \"transferring\": 17, \"checked\": 21, \"ipq4019\": 52, \"ipq8064\": 52, \"ie\": 28, \"measurement\": 28, \"crossing\": 28, \"past\": 28, \"frame\": 28, \"ext\": 16, \"response\": 18, \"io\": 17, \"populating\": 24, \"structure\": 104, \"hevc\": 21, \"avc\": 21, \"encoding\": 21, \"general\": 30, \"purpose\": 30, \"cpu\": 30, \"untrusted\": 30, \"chunks\": 17, \"tcemain\": 1, \"recycler\": 1, \"archivemail\": 2, \"insecurely\": 2, \"horde\": 6, \"groupware\": 6, \"mail\": 3, \"cloudforms\": 9, \"recoverable\": 2, \"yum\": 1, \"trojan\": 1, \"horse\": 1, \"aerogear\": 12, \"field\": 13, \"samba\": 105, \"ad\": 8, \"dirsync\": 8, \"starting\": 8, \"active\": 8, \"configured\": 12, \"custom\": 8, \"complexity\": 16, \"fail\": 8, \"ascii\": 8, \"weak\": 14, \"making\": 8, \"symfony2\": 5, \"loss\": 5, \"serialization\": 5, \"t2p\": 6, \"readwrite\": 6, \"pdf\": 6, \"tile\": 6, \"libtiff\": 13, \"jpeg\": 6, \"tifftag\": 6, \"jpegtables\": 6, \"libarchive\": 100, \"commit\": 65, \"379867ecb330b3a952fb7bfa7bffb7bbd5547205\": 6, \"onwards\": 130, \"cwe\": 69, \"476\": 6, \"acl\": 18, \"parser\": 21, \"archive\": 103, \"l\": 6, \"appear\": 32, \"exploitable\": 70, \"freebsd\": 1, 